/* SPDX-License-Identifier: LGPL-2.1-or-later */
#ಸೂಚನೆ once

#ಅನ್ತರ್ಭಾವ "forward.h"

ಪ್ರಕಾರವ್ಯಾಖ್ಯೆ ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ loadavg_t;

ಪೂರ್ಣಾಂಕ parse_boolean(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *v) ಶುದ್ಧ;
ಪೂರ್ಣಾಂಕ parse_tristate_ತುಂಬಿದ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *v, ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *ಮೂರನೇ, ಪೂರ್ಣಾಂಕ *ret);
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ parse_tristate(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *v, ಪೂರ್ಣಾಂಕ *ret) {
        ಹಿಂತಿರುಗಿ parse_tristate_ತುಂಬಿದ(v, ಖಾಲಿ, ret);
}
ಪೂರ್ಣಾಂಕ parse_pid(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, pid_t *ret);
ಪೂರ್ಣಾಂಕ parse_ಬಹುಲಕ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, mode_t *ret);
ಪೂರ್ಣಾಂಕ parse_ifindex(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s);
ಪೂರ್ಣಾಂಕ parse_mtu(ಪೂರ್ಣಾಂಕ family, ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, uint32_t *ret);

ಪೂರ್ಣಾಂಕ parse_ಗಾತ್ರ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *t, uint64_t base, uint64_t *ಗಾತ್ರ_2);
ಪೂರ್ಣಾಂಕ parse_sector_ಗಾತ್ರ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *t, uint64_t *ret);
ಪೂರ್ಣಾಂಕ parse_range(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *t, ಚಿಹ್ನೆರಹಿತ *ಅಧೋ, ಚಿಹ್ನೆರಹಿತ *ಊರ್ಧ್ವ);
ಪೂರ್ಣಾಂಕ parse_errno(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *t);
ಪೂರ್ಣಾಂಕ parse_fd(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *t);
ಪೂರ್ಣಾಂಕ parse_user_shell(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಅಕ್ಷರ **ret_sh, bool *ret_copy);

ಪೂರ್ಣಾಂಕ parse_capability_ಗಣ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, uint64_t initial, uint64_t *current);

#ವ್ಯಾಖ್ಯಾನಿಸು ಸುರಕ್ಷಿತ_ATO_REFUSE_PLUS_MINUS (1U << 30)
#ವ್ಯಾಖ್ಯಾನಿಸು ಸುರಕ್ಷಿತ_ATO_REFUSE_LEADING_ZERO (1U << 29)
#ವ್ಯಾಖ್ಯಾನಿಸು ಸುರಕ್ಷಿತ_ATO_REFUSE_LEADING_WHITESPACE (1U << 28)
#ವ್ಯಾಖ್ಯಾನಿಸು ಸುರಕ್ಷಿತ_ATO_ALL_FLAGS (ಸುರಕ್ಷಿತ_ATO_REFUSE_PLUS_MINUS|ಸುರಕ್ಷಿತ_ATO_REFUSE_LEADING_ZERO|ಸುರಕ್ಷಿತ_ATO_REFUSE_LEADING_WHITESPACE)
#ವ್ಯಾಖ್ಯಾನಿಸು ಸುರಕ್ಷಿತ_ATO_ಮುಖವಾಡ_FLAGS(base) ((base) & ~ಸುರಕ್ಷಿತ_ATO_ALL_FLAGS)

ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atou_ತುಂಬಿದ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಚಿಹ್ನೆರಹಿತ base, ಚಿಹ್ನೆರಹಿತ *ret_u);
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atou(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಚಿಹ್ನೆರಹಿತ *ret_u) {
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atou_ತುಂಬಿದ(s, 0, ret_u);
}

ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atou_bounded(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಚಿಹ್ನೆರಹಿತ min, ಚಿಹ್ನೆರಹಿತ max, ಚಿಹ್ನೆರಹಿತ *ret);

ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atoi(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಪೂರ್ಣಾಂಕ *ret_i);
ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atolli(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ದೀರ್ಘ ದೀರ್ಘ *ret_lli);

ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atou8_ತುಂಬಿದ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಚಿಹ್ನೆರಹಿತ base, uint8_t *ret);

ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atou8(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, uint8_t *ret) {
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atou8_ತುಂಬಿದ(s, 0, ret);
}

ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atou16_ತುಂಬಿದ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಚಿಹ್ನೆರಹಿತ base, uint16_t *ret);

ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atou16(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, uint16_t *ret) {
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atou16_ತುಂಬಿದ(s, 0, ret);
}

ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atoux16(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, uint16_t *ret) {
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atou16_ತುಂಬಿದ(s, 16, ret);
}

ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atoi16(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, int16_t *ret);

ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atou32_ತುಂಬಿದ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಚಿಹ್ನೆರಹಿತ base, uint32_t *ret_u) {
        assert_cc(ಗಾತ್ರ(uint32_t) == ಗಾತ್ರ(ಚಿಹ್ನೆರಹಿತ));
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atou_ತುಂಬಿದ(s, base, (ಚಿಹ್ನೆರಹಿತ*) ret_u);
}

ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atou32(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, uint32_t *ret_u) {
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atou32_ತುಂಬಿದ(s, 0, (ಚಿಹ್ನೆರಹಿತ*) ret_u);
}

ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atoi32(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, int32_t *ret_i) {
        assert_cc(ಗಾತ್ರ(int32_t) == ಗಾತ್ರ(ಪೂರ್ಣಾಂಕ));
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atoi(s, (ಪೂರ್ಣಾಂಕ*) ret_i);
}

ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atollu_ತುಂಬಿದ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಚಿಹ್ನೆರಹಿತ base, ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ ದೀರ್ಘ *ret_llu);

ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atollu(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ ದೀರ್ಘ *ret_llu) {
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atollu_ತುಂಬಿದ(s, 0, ret_llu);
}

ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atou64_ತುಂಬಿದ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಚಿಹ್ನೆರಹಿತ base, uint64_t *ret_u) {
        assert_cc(ಗಾತ್ರ(uint64_t) == ಗಾತ್ರ(ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ ದೀರ್ಘ));
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atollu_ತುಂಬಿದ(s, base, (ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ ದೀರ್ಘ*) ret_u);
}

ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atou64(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, uint64_t *ret_u) {
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atou64_ತುಂಬಿದ(s, 0, ret_u);
}

ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atoi64(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, int64_t *ret_i) {
        assert_cc(ಗಾತ್ರ(int64_t) == ಗಾತ್ರ(ದೀರ್ಘ ದೀರ್ಘ));
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atolli(s, (ದೀರ್ಘ ದೀರ್ಘ*) ret_i);
}

ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atoux64(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, uint64_t *ret) {
        assert_cc(ಗಾತ್ರ(int64_t) == ಗಾತ್ರ(ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ ದೀರ್ಘ));
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atollu_ತುಂಬಿದ(s, 16, (ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ ದೀರ್ಘ*) ret);
}

#ಆದರೆ LONG_MAX == ಗರಿಷ್ಠ_ಪೂರ್ಣಾಂಕ
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atolu_ತುಂಬಿದ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಚಿಹ್ನೆರಹಿತ base, ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ *ret_u) {
        assert_cc(ಗಾತ್ರ(ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ) == ಗಾತ್ರ(ಚಿಹ್ನೆರಹಿತ));
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atou_ತುಂಬಿದ(s, base, (ಚಿಹ್ನೆರಹಿತ*) ret_u);
}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atoli(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ದೀರ್ಘ *ret_u) {
        assert_cc(ಗಾತ್ರ(ದೀರ್ಘ) == ಗಾತ್ರ(ಪೂರ್ಣಾಂಕ));
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atoi(s, (ಪೂರ್ಣಾಂಕ*) ret_u);
}
#ಇಲ್ಲದಿದ್ದರೆ
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atolu_ತುಂಬಿದ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಚಿಹ್ನೆರಹಿತ base, ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ *ret_u) {
        assert_cc(ಗಾತ್ರ(ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ) == ಗಾತ್ರ(ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ ದೀರ್ಘ));
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atollu_ತುಂಬಿದ(s, base, (ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ ದೀರ್ಘ*) ret_u);
}
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atoli(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ದೀರ್ಘ *ret_u) {
        assert_cc(ಗಾತ್ರ(ದೀರ್ಘ) == ಗಾತ್ರ(ದೀರ್ಘ ದೀರ್ಘ));
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atolli(s, (ದೀರ್ಘ ದೀರ್ಘ*) ret_u);
}
#ಆದರೆ_ಅಂತ್ಯ

ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atolu(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ *ret_u) {
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atolu_ತುಂಬಿದ(s, 0, ret_u);
}

#ಆದರೆ SIZE_MAX == UINT_MAX
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atozu(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, size_t *ret_u) {
        assert_cc(ಗಾತ್ರ(size_t) == ಗಾತ್ರ(ಚಿಹ್ನೆರಹಿತ));
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atou(s, (ಚಿಹ್ನೆರಹಿತ *) ret_u);
}
#ಇಲ್ಲದಿದ್ದರೆ
ಸ್ಥಿರ ಸಾಲೊಳಗೆ ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atozu(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, size_t *ret_u) {
        assert_cc(ಗಾತ್ರ(size_t) == ಗಾತ್ರ(ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ));
        ಹಿಂತಿರುಗಿ ಸುರಕ್ಷಿತ_atolu(s, ret_u);
}
#ಆದರೆ_ಅಂತ್ಯ

ಪೂರ್ಣಾಂಕ ಸುರಕ್ಷಿತ_atod(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ದ್ವಿಗುಣ *ret_d);

ಪೂರ್ಣಾಂಕ parse_fractional_part_u(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ **p, size_t digits, ಚಿಹ್ನೆರಹಿತ *res);

ಪೂರ್ಣಾಂಕ parse_nice(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಪೂರ್ಣಾಂಕ *ret);

ಪೂರ್ಣಾಂಕ parse_ip_ಪೋರ್ಟ್(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, uint16_t *ret);
ಪೂರ್ಣಾಂಕ parse_ip_ಪೋರ್ಟ್_range(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, uint16_t *low, uint16_t *high, bool allow_zero);

ಪೂರ್ಣಾಂಕ parse_oom_score_adjust(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಪೂರ್ಣಾಂಕ *ret);

/* Implement floating point using fixed integers, to improve performance when
 * calculating load averages. These macros can be used to extract the integer
 * and decimal parts of a value. */
#ವ್ಯಾಖ್ಯಾನಿಸು LOADAVG_PRECISION_ಬಿಟ್ಟುಗಳು  11
#ವ್ಯಾಖ್ಯಾನಿಸು LOADAVG_FIXED_ಬಿಂದು_1_0 (1 << LOADAVG_PRECISION_ಬಿಟ್ಟುಗಳು)
#ವ್ಯಾಖ್ಯಾನಿಸು LOADAVG_INT_SIDE(x)     ((x) >> LOADAVG_PRECISION_ಬಿಟ್ಟುಗಳು)
#ವ್ಯಾಖ್ಯಾನಿಸು LOADAVG_DECIMAL_SIDE(x) LOADAVG_INT_SIDE(((x) & (LOADAVG_FIXED_ಬಿಂದು_1_0 - 1)) * 100)

/* Given a Linux load average (e.g. decimal number 34.89 where 34 is passed as i and 89 is passed as f), convert it
 * to a loadavg_t. */
ಪೂರ್ಣಾಂಕ store_loadavg_fixed_ಬಿಂದು(ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ i, ಚಿಹ್ನೆರಹಿತ ದೀರ್ಘ f, loadavg_t *ret);
ಪೂರ್ಣಾಂಕ parse_loadavg_fixed_ಬಿಂದು(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, loadavg_t *ret);

bool nft_identifier_valid(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *id);
