/* SPDX-License-Identifier: LGPL-2.1-or-later */
#సూచన once

#అన్తర్భావ "forward.h"

రకనిర్వచనం గుర్తులేని దీర్ఘ loadavg_t;

పూర్ణాంకం parse_boolean(స్థిరరాశి అక్షరం *v) శుద్ధ;
పూర్ణాంకం parse_tristate_నిండిన(స్థిరరాశి అక్షరం *v, స్థిరరాశి అక్షరం *మూడవ, పూర్ణాంకం *ret);
స్థిర అంతఃవరుస పూర్ణాంకం parse_tristate(స్థిరరాశి అక్షరం *v, పూర్ణాంకం *ret) {
        తిరిగి parse_tristate_నిండిన(v, ఖాళీ, ret);
}
పూర్ణాంకం parse_pid(స్థిరరాశి అక్షరం *s, pid_t *ret);
పూర్ణాంకం parse_బహుళకం(స్థిరరాశి అక్షరం *s, mode_t *ret);
పూర్ణాంకం parse_ifindex(స్థిరరాశి అక్షరం *s);
పూర్ణాంకం parse_mtu(పూర్ణాంకం family, స్థిరరాశి అక్షరం *s, uint32_t *ret);

పూర్ణాంకం parse_కొలత(స్థిరరాశి అక్షరం *t, uint64_t base, uint64_t *కొలత);
పూర్ణాంకం parse_sector_కొలత(స్థిరరాశి అక్షరం *t, uint64_t *ret);
పూర్ణాంకం parse_range(స్థిరరాశి అక్షరం *t, గుర్తులేని *క్రింది, గుర్తులేని *పై);
పూర్ణాంకం parse_errno(స్థిరరాశి అక్షరం *t);
పూర్ణాంకం parse_fd(స్థిరరాశి అక్షరం *t);
పూర్ణాంకం parse_user_shell(స్థిరరాశి అక్షరం *s, అక్షరం **ret_sh, bool *ret_copy);

పూర్ణాంకం parse_capability_సమితి(స్థిరరాశి అక్షరం *s, uint64_t initial, uint64_t *current);

#నిర్వచించు సురక్షిత_ATO_REFUSE_PLUS_MINUS (1U << 30)
#నిర్వచించు సురక్షిత_ATO_REFUSE_LEADING_ZERO (1U << 29)
#నిర్వచించు సురక్షిత_ATO_REFUSE_LEADING_WHITESPACE (1U << 28)
#నిర్వచించు సురక్షిత_ATO_ALL_FLAGS (సురక్షిత_ATO_REFUSE_PLUS_MINUS|సురక్షిత_ATO_REFUSE_LEADING_ZERO|సురక్షిత_ATO_REFUSE_LEADING_WHITESPACE)
#నిర్వచించు సురక్షిత_ATO_ముసుగు_FLAGS(base) ((base) & ~సురక్షిత_ATO_ALL_FLAGS)

పూర్ణాంకం సురక్షిత_atou_నిండిన(స్థిరరాశి అక్షరం *s, గుర్తులేని base, గుర్తులేని *ret_u);
స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atou(స్థిరరాశి అక్షరం *s, గుర్తులేని *ret_u) {
        తిరిగి సురక్షిత_atou_నిండిన(s, 0, ret_u);
}

పూర్ణాంకం సురక్షిత_atou_bounded(స్థిరరాశి అక్షరం *s, గుర్తులేని min, గుర్తులేని max, గుర్తులేని *ret);

పూర్ణాంకం సురక్షిత_atoi(స్థిరరాశి అక్షరం *s, పూర్ణాంకం *ret_i);
పూర్ణాంకం సురక్షిత_atolli(స్థిరరాశి అక్షరం *s, దీర్ఘ దీర్ఘ *ret_lli);

పూర్ణాంకం సురక్షిత_atou8_నిండిన(స్థిరరాశి అక్షరం *s, గుర్తులేని base, uint8_t *ret);

స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atou8(స్థిరరాశి అక్షరం *s, uint8_t *ret) {
        తిరిగి సురక్షిత_atou8_నిండిన(s, 0, ret);
}

పూర్ణాంకం సురక్షిత_atou16_నిండిన(స్థిరరాశి అక్షరం *s, గుర్తులేని base, uint16_t *ret);

స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atou16(స్థిరరాశి అక్షరం *s, uint16_t *ret) {
        తిరిగి సురక్షిత_atou16_నిండిన(s, 0, ret);
}

స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atoux16(స్థిరరాశి అక్షరం *s, uint16_t *ret) {
        తిరిగి సురక్షిత_atou16_నిండిన(s, 16, ret);
}

పూర్ణాంకం సురక్షిత_atoi16(స్థిరరాశి అక్షరం *s, int16_t *ret);

స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atou32_నిండిన(స్థిరరాశి అక్షరం *s, గుర్తులేని base, uint32_t *ret_u) {
        assert_cc(పరిమాణం(uint32_t) == పరిమాణం(గుర్తులేని));
        తిరిగి సురక్షిత_atou_నిండిన(s, base, (గుర్తులేని*) ret_u);
}

స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atou32(స్థిరరాశి అక్షరం *s, uint32_t *ret_u) {
        తిరిగి సురక్షిత_atou32_నిండిన(s, 0, (గుర్తులేని*) ret_u);
}

స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atoi32(స్థిరరాశి అక్షరం *s, int32_t *ret_i) {
        assert_cc(పరిమాణం(int32_t) == పరిమాణం(పూర్ణాంకం));
        తిరిగి సురక్షిత_atoi(s, (పూర్ణాంకం*) ret_i);
}

పూర్ణాంకం సురక్షిత_atollu_నిండిన(స్థిరరాశి అక్షరం *s, గుర్తులేని base, గుర్తులేని దీర్ఘ దీర్ఘ *ret_llu);

స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atollu(స్థిరరాశి అక్షరం *s, గుర్తులేని దీర్ఘ దీర్ఘ *ret_llu) {
        తిరిగి సురక్షిత_atollu_నిండిన(s, 0, ret_llu);
}

స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atou64_నిండిన(స్థిరరాశి అక్షరం *s, గుర్తులేని base, uint64_t *ret_u) {
        assert_cc(పరిమాణం(uint64_t) == పరిమాణం(గుర్తులేని దీర్ఘ దీర్ఘ));
        తిరిగి సురక్షిత_atollu_నిండిన(s, base, (గుర్తులేని దీర్ఘ దీర్ఘ*) ret_u);
}

స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atou64(స్థిరరాశి అక్షరం *s, uint64_t *ret_u) {
        తిరిగి సురక్షిత_atou64_నిండిన(s, 0, ret_u);
}

స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atoi64(స్థిరరాశి అక్షరం *s, int64_t *ret_i) {
        assert_cc(పరిమాణం(int64_t) == పరిమాణం(దీర్ఘ దీర్ఘ));
        తిరిగి సురక్షిత_atolli(s, (దీర్ఘ దీర్ఘ*) ret_i);
}

స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atoux64(స్థిరరాశి అక్షరం *s, uint64_t *ret) {
        assert_cc(పరిమాణం(int64_t) == పరిమాణం(గుర్తులేని దీర్ఘ దీర్ఘ));
        తిరిగి సురక్షిత_atollu_నిండిన(s, 16, (గుర్తులేని దీర్ఘ దీర్ఘ*) ret);
}

#ఒకవేళ LONG_MAX == గరిష్ఠ_పూర్ణాంకం
స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atolu_నిండిన(స్థిరరాశి అక్షరం *s, గుర్తులేని base, గుర్తులేని దీర్ఘ *ret_u) {
        assert_cc(పరిమాణం(గుర్తులేని దీర్ఘ) == పరిమాణం(గుర్తులేని));
        తిరిగి సురక్షిత_atou_నిండిన(s, base, (గుర్తులేని*) ret_u);
}
స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atoli(స్థిరరాశి అక్షరం *s, దీర్ఘ *ret_u) {
        assert_cc(పరిమాణం(దీర్ఘ) == పరిమాణం(పూర్ణాంకం));
        తిరిగి సురక్షిత_atoi(s, (పూర్ణాంకం*) ret_u);
}
#లేకపోతే
స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atolu_నిండిన(స్థిరరాశి అక్షరం *s, గుర్తులేని base, గుర్తులేని దీర్ఘ *ret_u) {
        assert_cc(పరిమాణం(గుర్తులేని దీర్ఘ) == పరిమాణం(గుర్తులేని దీర్ఘ దీర్ఘ));
        తిరిగి సురక్షిత_atollu_నిండిన(s, base, (గుర్తులేని దీర్ఘ దీర్ఘ*) ret_u);
}
స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atoli(స్థిరరాశి అక్షరం *s, దీర్ఘ *ret_u) {
        assert_cc(పరిమాణం(దీర్ఘ) == పరిమాణం(దీర్ఘ దీర్ఘ));
        తిరిగి సురక్షిత_atolli(s, (దీర్ఘ దీర్ఘ*) ret_u);
}
#అయితే_ముగింపు

స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atolu(స్థిరరాశి అక్షరం *s, గుర్తులేని దీర్ఘ *ret_u) {
        తిరిగి సురక్షిత_atolu_నిండిన(s, 0, ret_u);
}

#ఒకవేళ SIZE_MAX == UINT_MAX
స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atozu(స్థిరరాశి అక్షరం *s, size_t *ret_u) {
        assert_cc(పరిమాణం(size_t) == పరిమాణం(గుర్తులేని));
        తిరిగి సురక్షిత_atou(s, (గుర్తులేని *) ret_u);
}
#లేకపోతే
స్థిర అంతఃవరుస పూర్ణాంకం సురక్షిత_atozu(స్థిరరాశి అక్షరం *s, size_t *ret_u) {
        assert_cc(పరిమాణం(size_t) == పరిమాణం(గుర్తులేని దీర్ఘ));
        తిరిగి సురక్షిత_atolu(s, ret_u);
}
#అయితే_ముగింపు

పూర్ణాంకం సురక్షిత_atod(స్థిరరాశి అక్షరం *s, ద్విగుణ *ret_d);

పూర్ణాంకం parse_fractional_part_u(స్థిరరాశి అక్షరం **p, size_t digits, గుర్తులేని *res);

పూర్ణాంకం parse_nice(స్థిరరాశి అక్షరం *s, పూర్ణాంకం *ret);

పూర్ణాంకం parse_ip_పోర్టు(స్థిరరాశి అక్షరం *s, uint16_t *ret);
పూర్ణాంకం parse_ip_పోర్టు_range(స్థిరరాశి అక్షరం *s, uint16_t *low, uint16_t *high, bool allow_zero);

పూర్ణాంకం parse_oom_score_adjust(స్థిరరాశి అక్షరం *s, పూర్ణాంకం *ret);

/* Implement floating point using fixed integers, to improve performance when
 * calculating load averages. These macros can be used to extract the integer
 * and decimal parts of a value. */
#నిర్వచించు LOADAVG_PRECISION_బిట్లు  11
#నిర్వచించు LOADAVG_FIXED_బిందువు_1_0 (1 << LOADAVG_PRECISION_బిట్లు)
#నిర్వచించు LOADAVG_INT_SIDE(x)     ((x) >> LOADAVG_PRECISION_బిట్లు)
#నిర్వచించు LOADAVG_DECIMAL_SIDE(x) LOADAVG_INT_SIDE(((x) & (LOADAVG_FIXED_బిందువు_1_0 - 1)) * 100)

/* Given a Linux load average (e.g. decimal number 34.89 where 34 is passed as i and 89 is passed as f), convert it
 * to a loadavg_t. */
పూర్ణాంకం store_loadavg_fixed_బిందువు(గుర్తులేని దీర్ఘ i, గుర్తులేని దీర్ఘ f, loadavg_t *ret);
పూర్ణాంకం parse_loadavg_fixed_బిందువు(స్థిరరాశి అక్షరం *s, loadavg_t *ret);

bool nft_identifier_valid(స్థిరరాశి అక్షరం *id);
